<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/practice.png' width=300/></center>

# 실습 목표

- CSV 파일에서 데이터를 읽어올 수 있습니다.
- 불필요한 열을 제거할 수 있습니다.
- 기존 열의 값을 바꿀 수 있습니다.
- 기존 열에 대한 계산 결과를 갖는 새로운 열을 추가할 수 있습니다.
- 열 이름을 바꿀 수 있습니다.

# P4. 데이터프레임 변경(1)

In [1]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

1) 'titanic_simple.csv' 파일을 불러와 데이터프레임 **titanic**을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'

In [2]:
# titanic 데이터 불러오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/titanic_simple.csv'
titanic = pd.read_csv(file_path, sep = ',')

# 확인
titanic.head()

   PassengerId  Survived  Pclass  ...   Age     Fare      Embarked
0            1         0       3  ...  22.0   7.2500  Southhampton
1            2         1       1  ...  38.0  71.2833     Cherbourg
2            3         1       3  ...  26.0   7.9250  Southhampton
3            4         1       1  ...  35.0  53.1000  Southhampton
4            5         0       3  ...  35.0   8.0500  Southhampton

[5 rows x 8 columns]

2) drop() 메소드를 사용해 Name, PassengerId 열을 삭제하세요.

In [3]:
# Name 열 삭제
titanic.drop(['Name', 'PassengerId'], axis=1, inplace=True)

# 확인
titanic.head()

   Survived  Pclass     Sex   Age     Fare      Embarked
0         0       3    male  22.0   7.2500  Southhampton
1         1       1  female  38.0  71.2833     Cherbourg
2         1       3  female  26.0   7.9250  Southhampton
3         1       1  female  35.0  53.1000  Southhampton
4         0       3    male  35.0   8.0500  Southhampton

3) 모든 열 이름을 소문자로 변경하세요.

In [4]:
titanic.columns = titanic.columns.str.lower()

# 확인
titanic.head()

   survived  pclass     sex   age     fare      embarked
0         0       3    male  22.0   7.2500  Southhampton
1         1       1  female  38.0  71.2833     Cherbourg
2         1       3  female  26.0   7.9250  Southhampton
3         1       1  female  35.0  53.1000  Southhampton
4         0       3    male  35.0   8.0500  Southhampton

In [5]:
# 열 이름 변경
titanic.columns = ['survived', 'pclass', 'sex' ,'age' ,'fare', 'embarked']

# 확인
titanic.head()

   survived  pclass     sex   age     fare      embarked
0         0       3    male  22.0   7.2500  Southhampton
1         1       1  female  38.0  71.2833     Cherbourg
2         1       3  female  26.0   7.9250  Southhampton
3         1       1  female  35.0  53.1000  Southhampton
4         0       3    male  35.0   8.0500  Southhampton

4) insert() 메소드를 사용해 5번째 열로, 즉 age 열 뒤에 0을 갖는 age2를 추가하세요.

In [6]:
# age2 열 추가
titanic.insert(4, 'age2', 0)

# 확인
titanic.head()

   survived  pclass     sex   age  age2     fare      embarked
0         0       3    male  22.0     0   7.2500  Southhampton
1         1       1  female  38.0     0  71.2833     Cherbourg
2         1       3  female  26.0     0   7.9250  Southhampton
3         1       1  female  35.0     0  53.1000  Southhampton
4         0       3    male  35.0     0   8.0500  Southhampton

5) age2 열이 age // 10 * 10 계산 결과를 갖게 변경하세요.

In [7]:
# age2 열 변경
titanic['age2'] = titanic['age'] // 10 * 10

# 확인
titanic.head()

   survived  pclass     sex   age  age2     fare      embarked
0         0       3    male  22.0  20.0   7.2500  Southhampton
1         1       1  female  38.0  30.0  71.2833     Cherbourg
2         1       3  female  26.0  20.0   7.9250  Southhampton
3         1       1  female  35.0  30.0  53.1000  Southhampton
4         0       3    male  35.0  30.0   8.0500  Southhampton

6) sex 열 뒤에 0 을 갖는 sex2 열을 추가하세요.

In [8]:
# sex2 열 추가
titanic.insert(3, 'sex2', 0)

# 확인
titanic.head()

   survived  pclass     sex  sex2   age  age2     fare      embarked
0         0       3    male     0  22.0  20.0   7.2500  Southhampton
1         1       1  female     0  38.0  30.0  71.2833     Cherbourg
2         1       3  female     0  26.0  20.0   7.9250  Southhampton
3         1       1  female     0  35.0  30.0  53.1000  Southhampton
4         0       3    male     0  35.0  30.0   8.0500  Southhampton

7) sex 열 값을 참조해 sex2 열이 'female', 'male' 대신 0, 1을 갖도록 map() 메소드로 변경하세요.

In [9]:
# female --> 0, male --> 1 
titanic['sex2'] = titanic['sex'].map({'female':0, 'male':1})

# 확인
titanic.head()

   survived  pclass     sex  sex2   age  age2     fare      embarked
0         0       3    male     1  22.0  20.0   7.2500  Southhampton
1         1       1  female     0  38.0  30.0  71.2833     Cherbourg
2         1       3  female     0  26.0  20.0   7.9250  Southhampton
3         1       1  female     0  35.0  30.0  53.1000  Southhampton
4         0       3    male     1  35.0  30.0   8.0500  Southhampton

8) embarked 열의 첫 글자만을 갖는 embarked2 열을 맨 뒤에 추가하세요.

In [10]:
# embarked2 열 추가
titanic['embarked2'] = titanic['embarked'].str[0]

# 확인
titanic.head()

   survived  pclass     sex  sex2   age  age2     fare      embarked embarked2
0         0       3    male     1  22.0  20.0   7.2500  Southhampton         S
1         1       1  female     0  38.0  30.0  71.2833     Cherbourg         C
2         1       3  female     0  26.0  20.0   7.9250  Southhampton         S
3         1       1  female     0  35.0  30.0  53.1000  Southhampton         S
4         0       3    male     1  35.0  30.0   8.0500  Southhampton         S

9) sex, age, embarked 열을 제거하세요.

In [11]:
# 열 제거
titanic.drop(['sex', 'age', 'embarked'], axis=1, inplace=True)

# 확인
titanic.head()

   survived  pclass  sex2  age2     fare embarked2
0         0       3     1  20.0   7.2500         S
1         1       1     0  30.0  71.2833         C
2         1       3     0  20.0   7.9250         S
3         1       1     0  30.0  53.1000         S
4         0       3     1  30.0   8.0500         S

10) sex2, age2, embarked2 열 이름을 각각 sex, age, embarked로 변경하세요.

In [12]:
# 열 이름 변경
titanic.rename(columns={'sex2': 'sex', 'age2': 'age', 'embarked2': 'embarked'}, inplace=True)

# 확인
titanic.head()

   survived  pclass  sex   age     fare embarked
0         0       3    1  20.0   7.2500        S
1         1       1    0  30.0  71.2833        C
2         1       3    0  20.0   7.9250        S
3         1       1    0  30.0  53.1000        S
4         0       3    1  30.0   8.0500        S

11) 'Graduate_apply.csv' 파일을 불러와 데이터프레임 **graduate**을 만드세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'

In [13]:
# graduate 데이터 불러오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
graduate = pd.read_csv(file_path, sep = ',')

# 확인
graduate.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

12) gre 열 값의 크기를 기준으로 4 등분하여 범주형 값 1, 2, 3, 4를 갖는 gre_group 열을 추가하세요.

- 단, 1 > 2 > 3 > 4 의 의미를 가져야 합니다.

In [14]:
# 값 크기를 기준으로 4개 범위로 나누기
graduate['gre_group'] = pd.cut(graduate['gre'], 4, labels=[4, 3, 2, 1])

# 확인
graduate.head()

   admit  gre   gpa  rank gre_group
0      0  380  3.61     3         3
1      1  660  3.67     3         1
2      1  800  4.00     1         1
3      1  640  3.19     4         2
4      0  520  2.93     4         2

13) gpa 열 값을 기준으로 같은 개수를 갖도록 4 등분하여 범주형 값 1, 2, 3, 4를 갖는 gpa_group 열을 추가하세요.

- 단, 1 > 2 > 3 > 4 의 의미를 가져야 합니다.

In [15]:
# 개수를 기준으로 4개 범위로 나누기
graduate['gpa_group'] = pd.qcut(graduate['gpa'], 4, labels=[4, 3, 2, 1])

# 확인
graduate.head()

   admit  gre   gpa  rank gre_group gpa_group
0      0  380  3.61     3         3         2
1      1  660  3.67     3         1         2
2      1  800  4.00     1         1         1
3      1  640  3.19     4         2         3
4      0  520  2.93     4         2         4

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/end.png' width=300/></center>